Repository: Seeriis/SerrisCodeEditor
Catalog: SerrisCodeEditor/SerrisCodeEditor/Strings/*/Resources.resw
Source language: en_us
Languages: es_es, fr_fr

# bonjour-betausersmessage.Text
source: With this final version, Serris Code Editor use a new tabs system, so you will need to open again your files. Tools like Serris Web Render or Themes creator will be back soon !
es_es: Con esta versión final, Serris Code Editor usa un nuevo sistema de pestañas, por lo que deberá volver a abrir sus archivos. ¡Herramientas como Serris Web Render o el creador de temas volverán pronto!
fr_fr: Avec cette version finale, Serris Code Editor utilise un nouveau système d'onglets, donc vous devrez ouvrir à nouveau vos fichiers dans l'application. Les outils comme Serris Web Render ou Themes creator seront bientôt de retour !

# bonjour-betauserswarning.Text
source: For SCE beta users
es_es: Para usuarios de SCE beta
fr_fr: Pour les utilisateurs de la bêta de SCE

# bonjour-buttonchangelogtext.Text
source: See the changelog
es_es: Ver el registro de cambios
fr_fr: Voir le changelog

# bonjour-closebutton.Text
source: Close
es_es: Cerrar
fr_fr: Fermer

# bonjour-nowversiontext.Text
source: You are now on the version
es_es: Ahora estás en la versión
fr_fr: Vous êtes maintenant sur la version

# console-clearbuttontooltip.ToolTipService.ToolTip
source: Clear console
es_es: Despejar la consola
fr_fr: Nettoyer la console

# console-commandboxplaceholder.PlaceholderText
source: Execute a JavaScript command (example: console.log( "1 + 1 = " + (1 + 1) ); )
es_es: Ejecutar un comando de JavaScript (ejemplo: console.log( "1 + 1 = " + (1 + 1) ); )
fr_fr: Exécuter une commande JavaScript (exemple: console.log( "1 + 1 = " + (1 + 1) ); )

# console-errorstooltip.ToolTipService.ToolTip
source: Error(s)
es_es: Error(es)
fr_fr: Erreur(s)

# console-informationstooltip.ToolTipService.ToolTip
source: Information(s)
es_es: Información(es)

# console-resultstooltip.ToolTipService.ToolTip
source: Result(s)
es_es: Resultado(s)
fr_fr: Résultat(s)

# console-warningstooltip.ToolTipService.ToolTip
source: Warning(s)
es_es: Advertencia(s)
fr_fr: Avertissement(s)

# encodings-utf8bom
source: UTF-8 with BOM/Signature
es_es: UTF-8 con BOM/Signature
fr_fr: UTF-8 avec BOM/Signature

# encodings-utf8nobom
source: UTF-8 without BOM/Signature (default)
es_es: UTF-8 sin BOM/Signature (por defecto)
fr_fr: UTF-8 sans BOM/Signature (par défaut)

# modulesmanager-openingmanagertooltip.ToolTipService.ToolTip
source: Show modules manager
es_es: Mostrar administrador de módulos
fr_fr: Afficher le gestionnaire de modules

# modulesmanager-pinmodules.ToolTipService.ToolTip
source: Pin/unpin module to the toolbar
es_es: Pin/desprender módulo a la barra de herramientas
fr_fr: Épingler/détacher le module de la barre d'outil

# modulesmanager-proglanguages.ToolTipService.ToolTip
source: Programming languages
es_es: Lenguajes de programación
fr_fr: Langages de programmation

# modulesmanager-templates.ToolTipService.ToolTip
source: Projects/files templates
es_es: Plantillas de archivos/proyectos
fr_fr: Modèles de projets/fichiers

# modulesmanager-themes.ToolTipService.ToolTip
source: Themes
es_es: Temas
fr_fr: Thèmes

# modulesmanager-titleflyout
source: Modules manager
es_es: Gerente de módulos
fr_fr: Gestionnaire de modules

# news-buttontooltip.ToolTipService.ToolTip
source: News
es_es: Noticias
fr_fr: Actualités

# news-commentstext.Text
source: Comments
es_es: Comentarios
fr_fr: Commentaires

# news-notificationsswitch.Header
source: News notifications
es_es: Notificaciones de noticias
fr_fr: Notifications d'actualité

# news-refreshlistbutton.ToolTipService.ToolTip
source: Refresh news
es_es: Actualizar noticias
fr_fr: Rafraîchir les actualités

# news-seecommentstext.Text
source: See comments
es_es: Ver comentarios
fr_fr: Voir les commentaires

# news-titleflyout
source: News
es_es: Noticias
fr_fr: Actualités

# popup-changeencodingaccept
source: Yes, update encoding !
es_es: Sí, actualizar la codificación!
fr_fr: Oui, mettre à jour l'encodage !

# popup-changeencodingcontent
source: Serris Code Editor have maybe detect a better encoding type for your file. If you choose to update the encoding, you will need to save again your file for use the new encoding.
es_es: Serris Code Editor ha detectado un mejor tipo de codificación para su archivo. Si decide actualizar la codificación, deberá volver a guardar el archivo para utilizar la nueva codificación.
fr_fr: Serris Code Editor a peut-être détecté un meilleur type d'encodage pour votre fichier. Si vous choisissez de mettre à jour l'encodage, vous devrez à nouveau enregistrer votre fichier pour utiliser le nouvel encodage.

# popup-changeencodinglater
source: Maybe later
es_es: Quizás más tarde
fr_fr: Peut-être plus tard

# popup-changeencodingtitle
source: Change {0} encoding to {1} encoding ?
es_es: Cambiar la codificación {0} a codificación {1} ?
fr_fr: Changer l'encodage {0} en encodage {1} ?

# popup-errorreadingfile
source: Error during reading the file :(
es_es: Error al leer el archivo :(
fr_fr: Erreur lors de la lecture du fichier :(

# popup-updatedfileaccept
source: Update the content in the editor
es_es: Actualizar el contenido en el editor
fr_fr: Mettre à jour le contenu dans l'éditeur

# popup-updatedfilerefuse
source: Don't update
es_es: No actualizar
fr_fr: Ne pas mettre à jour

# popup-updatedfiletitle
source: {0} has been modified outside of the editor. Update the content ?
es_es: {0} ha sido modificado fuera del editor. Actualizar el contenido?
fr_fr: {0} a été modifié en dehors de l'éditeur. Mettre à jour le contenu ?

# settings-buttonlicense
source: See the license
es_es: Ver la licencia
fr_fr: Voir la licence

# settings-buttontooltip.ToolTipService.ToolTip
source: Settings
es_es: Configuracion
fr_fr: Paramètres

# settings-credits
source: Credits
es_es: Créditos
fr_fr: Crédits

# settings-credits_aboutapp
source: About the application
es_es: Sobre la aplicación
fr_fr: À propos de l'application

# settings-credits_byseeriis
source: By Seeriis
es_es: Por Seeriis
fr_fr: Par Seeriis

# settings-credits_licenses
source: Licenses
es_es: Licencias
fr_fr: Licences

# settings-credits_maindev
source: Main developer
es_es: Desarrollador principal
fr_fr: Développeur principal

# settings-credits_scegithub
source: Become a SCE contributor on GitHub !
es_es: ¡Contribuye a SCE en GitHub!
fr_fr: Devenez un contributeur SCE sur GitHub !

# settings-credits_version
source: Version
es_es: Versión

# settings-editor_fontfamily
source: Font family
es_es: Tipo de fuente
fr_fr: Police d'écriture

# settings-editor_fontsize
source: Font size (in pixel)
es_es: Tamaño de fuente (en píxeles)
fr_fr: Taille de la police (en pixel)

# settings-editor_quicksuggests
source: Show quick suggestions
es_es: Mostrar sugerencias rápidas
fr_fr: Afficher les suggestions rapides

# settings-editor_showline
source: Show line numbers
es_es: Mostrar números de línea
fr_fr: Afficher le nombre de lignes

# settings-editor_showminimap
source: Show minimap
es_es: Mostrar minimapa
fr_fr: Afficher la mini-carte

# settings-editor_wrappingcode
source: Wrapping code
es_es: Vuelta a la línea
fr_fr: Retour a la ligne auto.

# settings-titleflyout
source: Settings
es_es: Configuracion
fr_fr: Paramètres

# settings-ui
source: UI
es_es: GUI
fr_fr: Interface

# settings-ui_closepanelauto
source: Close the left panel automatically
es_es: Cierre el panel izquierdo automáticamente
fr_fr: Fermez le panneau de gauche auto.

# settings-ui_extendedview
source: UI extended view mode
es_es: Interfaz extendida
fr_fr: Interface étendue

# settings-ui_leftpanelength
source: Left pane reduced length (in pixel)
es_es: Tamaño del panel izquierdo reducido (en píxeles)
fr_fr: Largeur du panneau de gauche réduit (en pixel)

# settings-ui_leftpaneopenlength
source: Left pane opened length (in pixel)
es_es: Tamaño del panel izquierdo abierto (en píxeles)
fr_fr: Largeur du panneau de gauche ouvert (en pixel)

# sheet-pintooltip.ToolTipService.ToolTip
source: Pin the view
es_es: Alfiler la vista
fr_fr: Épingler la vue

# sheetview-unpintooltip.ToolTipService.ToolTip
source: Unpin the view
es_es: Despegar la vista
fr_fr: Détacher la vue

# storages-localstorage
source: Local storage
es_es: Almacenamiento local
fr_fr: Stockage local

# tab-createdattext.Text
source: Created at :
es_es: Creado :
fr_fr: Créer à :

# tab-deletetabtooltip.ToolTipService.ToolTip
source: Delete tab
es_es: Eliminar pestaña
fr_fr: Supprimer l'onglet

# tab-encodingtext.Text
source: Encoding :
es_es: Codificación :
fr_fr: Encodage :

# tab-modifiedattext.Text
source: Modified at :
es_es: Modificado :
fr_fr: Modifier à :

# tab-moreinfostooltip.ToolTipService.ToolTip
source: Show more informations
es_es: Mostrar más información
fr_fr: Afficher plus d'informations

# tab-renameaccepttooltip.ToolTipService.ToolTip
source: Accept rename
es_es: Renombrar
fr_fr: Renommer

# tab-renameplaceholder.PlaceholderText
source: Example: toothless.js
es_es: Ejemplo: toothless.js
fr_fr: Exemple : toothless.js

# tab-renametabtooltip.ToolTipService.ToolTip
source: Rename tab
es_es: Renombrar pestaña
fr_fr: Renommer l'onglet

# tab-sizetext.Text
source: Size :
es_es: Tamaño :
fr_fr: Taille :

# tab-typetext.Text
source: Type :
es_es: Tipo :

# tabslist-blanktabradiobutton.Content
source: Blank tab
es_es: Pestaña vacia
fr_fr: Onglet vierge

# tabslist-buttonaddtabslists
source: Add new tab(s)/list(s)
es_es: Agregar nueva pestaña(s)/lista(s)
fr_fr: Ajouter des nouveaux onglet(s)/liste(s)

# tabslist-buttoncreatelist
source: Create new list/project
es_es: Crear nueva lista/proyecto
fr_fr: Créer une nouvelle liste/projet

# tabslist-buttoncreatetab
source: Create new tab
es_es: Crear nueva pestaña
fr_fr: Créer un nouvel onglet

# tabslist-buttongoback
source: Go back
es_es: Regresar
fr_fr: Retourner en arrière

# tabslist-createnewtabtitle.Text
source: Create new tab
es_es: Crear nueva pestaña
fr_fr: Créer un nouveau onglet

# tabslist-defaultlistname
source: Default list
es_es: Lista predeterminada
fr_fr: Liste par défaut

# tabslist-defaulttabname
source: New Tab
es_es: Nueva pestaña
fr_fr: Nouvel onglet

# tabslist-deletelistbutton.Text
source: Delete
es_es: Borrar
fr_fr: Supprimer

# tabslist-fileencodingtitle.Text
source: File encoding
es_es: Codificación del archivo
fr_fr: Encodage du fichier

# tabslist-importfilestextbutton.Text
source: File(s)
es_es: Archivo(s)
fr_fr: Fichier(s)

# tabslist-importfilestooltip.ToolTipService.ToolTip
source: Import file(s)
es_es: Importar archivo(s)
fr_fr: Importer des fichier(s)

# tabslist-listsettingsplaceholder.ToolTipService.ToolTip
source: List/project settings
es_es: Configuración del proyecto/lista
fr_fr: Paramètre de la liste/du projet

# tabslist-newfileprojectcreatebuttontooltip.ToolTipService.ToolTip
source: Create tab/list
es_es: Crear pestaña/lista
fr_fr: Créer l'onglet/la liste

# tabslist-newprojectradiobutton.Content
source: New project
es_es: Nuevo proyecto
fr_fr: Nouveau projet

# tabslist-newtabslistradiobutton.Content
source: New tabs list
es_es: Nueva lista de pestañas
fr_fr: Nouvelle liste d'onglets

# tabslist-opentitle.Text
source: Open...
es_es: Abrir...
fr_fr: Ouvrir...

# tabslist-placeholderfileexample
source: Example: toothless.js
es_es: Ejemplo: toothless.js
fr_fr: Exemple: toothless.js

# tabslist-placeholderprojectexample
source: Example: project csharp
es_es: Ejemplo: project csharp
fr_fr: Exemple: project csharp

# tabslist-searchboxplaceholder.PlaceholderText
source: Search tab...
es_es: Buscar pestaña...
fr_fr: Chercher un onglet...

# tabslist-selectlistbutton.Text
source: List/project
es_es: Lista/proyecto
fr_fr: Liste/projet

# tabslist-selecttabbutton.Text
source: Tab
es_es: Pestaña
fr_fr: Onglet

# tabslist-tabtemplateradiobutton.Content
source: Use tab template
es_es: Usar modelo de pestaña
fr_fr: Utiliser un modèle d'onglet

# tabslist-titlesheet
source: Tabs list
es_es: Lista de pestañas
fr_fr: Liste d'onglets

# tabslist-warningdeletelisttext.Text
source: Are you sure to delete this list ?
es_es: ¿Estás seguro de borrar esta lista?
fr_fr: Êtes-vous sûr de supprimer cette liste ?

# popup-changeencodingno
source: No
fr_fr: Non

# popup-updatedfilecontent
source: The file has been modified at {0} but the last time you have saved the modifications on this file on the editor was at {1}
fr_fr: Le fichier a été modifié à {0} mais la dernière fois que vous avez enregistré les modifications sur ce fichier sur l'éditeur était à {1}

# settings-editor
source: Editor
fr_fr: Éditeur
